app/controllers/users_controller.rb

INSERT INTO "users" ("password_digest", "created_at", "updated_at") VALUES (?, ?, ?)  [["password_digest", "$2a$12$lGHaDb6nYza4gUK1/Fly4u3pIc581DJfgwXU85kQ8w8tswO5R3ymu"], ["created_at", "2019-11-12 21:47:54.586568"], ["updated_at", "2019-11-12 21:47:54.586568"]]
---
    def create
        encrypted_password = BCrypt::Password.create(params[:password])
        @user = User.create(
            username: params[:username],
            name: params[:name],
            location: params[:location],
            password_digest: encrypted_password
        )